Autodesk.Revit.DB.ExportPatternTable.GetExportPatternTableIteratorInternal
Returns a ExportPatternTableIterator to the pattern table.
Since:
2014

Autodesk.Revit.DB.ExportPatternTable.GetEnumerator
Returns an enumerator that iterates through the collection.
Returns: An IEnumerator( KeyValuePair(ExportPatternKey^,ExportPatternInfo^) ) object that can be used to iterate through key-value pairs in the collection.